<template>
    <div class="m-menu">
        <dl class="nav" @mouseleave = "menuLeave">
            <dt>全部分类</dt>
            <dd v-for="(item,index) in menuList" :key="index" @mouseenter="menuEnter(item)">
                <i :class="item.type"></i>
                {{item.name}}
                <span class="arrow"></span>
            </dd>
            
        </dl>
        <div v-if="curDetail" class="detail" @mouseenter = "detailEnter" @mouseleave = "detailLeave">
            <template v-for="(item, index) in curDetail.items">
                <h4 :key="index">{{item.title}}</h4>
                <span v-for="(v, i) in item.items" :key="v + '_' + i">{{v}}</span>
            </template>
        </div>
    </div>

</template>

<script>
import api from '@/api/index.js'
export default {
    created(){
        api.getMeunList().then(res => {
            this.menuList = res.data.data;
        });
    },
    methods:{
        menuEnter(item){
            this.curDetail = item;
        },
        menuLeave(){
            var self = this;
            this.timer = setTimeout(function(){
                self.curDetail = null;
            },100);
        },
        detailEnter(){
            clearTimeout(this.timer);
        },
        detailLeave(){
             this.curDetail = null;
        }
    },
    data(){
        return {
            curDetail: null,
            menuList:[]
            // menuList:[
            // {
            //     title: '美食',
            //     icon: 'food',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '外卖',
            //     icon: 'takeout',
            //     children:[{
            //         title: '外卖',
            //         children:[
            //                     '美团外卖'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '酒店',
            //     icon: 'hotel',
            //     children:[{
            //         title: '酒店星级',
            //         children:['经济型','舒适/三星','高档/四星','豪华/五星'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '榛果民宿',
            //     icon: 'homestay',
            //     children:[{
            //         title: '热门城市',
            //         children:['上海','成都','北京',
            //                   '广州','杭州','深圳'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '猫眼电影',
            //     icon: 'movie',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '机票/火车票',
            //     icon: 'airport',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '休闲娱乐/ktv',
            //     icon: 'ktv',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '生活服务',
            //     icon: 'life',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '丽人/美发/医疗美容',
            //     icon: 'hair',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '美食',
            //     icon: 'food',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '美食',
            //     icon: 'food',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '美食',
            //     icon: 'food',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '美食',
            //     icon: 'food',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '美食',
            //     icon: 'food',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '美食',
            //     icon: 'food',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            //  {
            //     title: '美食',
            //     icon: 'food',
            //     children:[{
            //         title: '美食',
            //         children:['代金券','甜点饮品','火锅自助餐',
            //                   '小吃快餐','日韩料理','西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜',
            //                   '江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆','云贵菜',
            //                   '东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'
            //                 ]
            //     }]
            // },
            // ]
        }
    }
}
</script>

<style scoped>

</style>